grevaillot/svd_tools/headers/ATSAMV71J19/gmac.h
/** @defgroup gmac_gmac_ncr GMACNCR Network Control Register
@{*/

/** GMAC_GMAC_NCR_FNP Flush Next Packet **/
#define GMAC_GMAC_NCR_FNP		(1 << 18)
/** GMAC_GMAC_NCR_TXPBPF Transmit PFC Priority-based Pause Frame **/
#define GMAC_GMAC_NCR_TXPBPF		(1 << 17)
/** GMAC_GMAC_NCR_ENPBPR Enable PFC Priority-based Pause Reception **/
#define GMAC_GMAC_NCR_ENPBPR		(1 << 16)
/** GMAC_GMAC_NCR_SRTSM Store Receive Time Stamp to Memory **/
#define GMAC_GMAC_NCR_SRTSM		(1 << 15)
/** GMAC_GMAC_NCR_TXZQPF Transmit Zero Quantum Pause Frame **/
#define GMAC_GMAC_NCR_TXZQPF		(1 << 12)
/** GMAC_GMAC_NCR_TXPF Transmit Pause Frame **/
#define GMAC_GMAC_NCR_TXPF		(1 << 11)
/** GMAC_GMAC_NCR_THALT Transmit Halt **/
#define GMAC_GMAC_NCR_THALT		(1 << 10)
/** GMAC_GMAC_NCR_TSTART Start Transmission **/
#define GMAC_GMAC_NCR_TSTART		(1 << 9)
/** GMAC_GMAC_NCR_BP Back pressure **/
#define GMAC_GMAC_NCR_BP		(1 << 8)
/** GMAC_GMAC_NCR_WESTAT Write Enable for Statistics Registers **/
#define GMAC_GMAC_NCR_WESTAT		(1 << 7)
/** GMAC_GMAC_NCR_INCSTAT Increment Statistics Registers **/
#define GMAC_GMAC_NCR_INCSTAT		(1 << 6)
/** GMAC_GMAC_NCR_CLRSTAT Clear Statistics Registers **/
#define GMAC_GMAC_NCR_CLRSTAT		(1 << 5)
/** GMAC_GMAC_NCR_MPE Management Port Enable **/
#define GMAC_GMAC_NCR_MPE		(1 << 4)
/** GMAC_GMAC_NCR_TXEN Transmit Enable **/
#define GMAC_GMAC_NCR_TXEN		(1 << 3)
/** GMAC_GMAC_NCR_RXEN Receive Enable **/
#define GMAC_GMAC_NCR_RXEN		(1 << 2)
/** GMAC_GMAC_NCR_LBL Loop Back Local **/
#define GMAC_GMAC_NCR_LBL		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_ncfgr GMACNCFGR Network Configuration Register
@{*/

/** GMAC_GMAC_NCFGR_IRXER Ignore IPG GRXER **/
#define GMAC_GMAC_NCFGR_IRXER		(1 << 30)
/** GMAC_GMAC_NCFGR_RXBP Receive Bad Preamble **/
#define GMAC_GMAC_NCFGR_RXBP		(1 << 29)
/** GMAC_GMAC_NCFGR_IPGSEN IP Stretch Enable **/
#define GMAC_GMAC_NCFGR_IPGSEN		(1 << 28)
/** GMAC_GMAC_NCFGR_IRXFCS Ignore RX FCS **/
#define GMAC_GMAC_NCFGR_IRXFCS		(1 << 26)
/** GMAC_GMAC_NCFGR_EFRHD Enable Frames Received in Half Duplex **/
#define GMAC_GMAC_NCFGR_EFRHD		(1 << 25)
/** GMAC_GMAC_NCFGR_RXCOEN Receive Checksum Offload Enable **/
#define GMAC_GMAC_NCFGR_RXCOEN		(1 << 24)
/** GMAC_GMAC_NCFGR_DCPF Disable Copy of Pause Frames **/
#define GMAC_GMAC_NCFGR_DCPF		(1 << 23)

#define GMAC_GMAC_NCFGR_DBW_SHIFT		21
#define GMAC_GMAC_NCFGR_DBW_MASK		0x03
/** @defgroup gmac_gmac_ncfgr_dbw DBW Data Bus Width
@{*/
/**@}*/


#define GMAC_GMAC_NCFGR_CLK_SHIFT		18
#define GMAC_GMAC_NCFGR_CLK_MASK		0x07
/** @defgroup gmac_gmac_ncfgr_clk CLK MDC CLock Division
@{*/
/**@}*/

/** GMAC_GMAC_NCFGR_RFCS Remove FCS **/
#define GMAC_GMAC_NCFGR_RFCS		(1 << 17)
/** GMAC_GMAC_NCFGR_LFERD Length Field Error Frame Discard **/
#define GMAC_GMAC_NCFGR_LFERD		(1 << 16)

#define GMAC_GMAC_NCFGR_RXBUFO_SHIFT		14
#define GMAC_GMAC_NCFGR_RXBUFO_MASK		0x03
/** @defgroup gmac_gmac_ncfgr_rxbufo RXBUFO Receive Buffer Offset
@{*/
/**@}*/

/** GMAC_GMAC_NCFGR_PEN Pause Enable **/
#define GMAC_GMAC_NCFGR_PEN		(1 << 13)
/** GMAC_GMAC_NCFGR_RTY Retry Test **/
#define GMAC_GMAC_NCFGR_RTY		(1 << 12)
/** GMAC_GMAC_NCFGR_MAXFS 1536 Maximum Frame Size **/
#define GMAC_GMAC_NCFGR_MAXFS		(1 << 8)
/** GMAC_GMAC_NCFGR_UNIHEN Unicast Hash Enable **/
#define GMAC_GMAC_NCFGR_UNIHEN		(1 << 7)
/** GMAC_GMAC_NCFGR_MTIHEN Multicast Hash Enable **/
#define GMAC_GMAC_NCFGR_MTIHEN		(1 << 6)
/** GMAC_GMAC_NCFGR_NBC No Broadcast **/
#define GMAC_GMAC_NCFGR_NBC		(1 << 5)
/** GMAC_GMAC_NCFGR_CAF Copy All Frames **/
#define GMAC_GMAC_NCFGR_CAF		(1 << 4)
/** GMAC_GMAC_NCFGR_JFRAME Jumbo Frame Size **/
#define GMAC_GMAC_NCFGR_JFRAME		(1 << 3)
/** GMAC_GMAC_NCFGR_DNVLAN Discard Non-VLAN FRAMES **/
#define GMAC_GMAC_NCFGR_DNVLAN		(1 << 2)
/** GMAC_GMAC_NCFGR_FD Full Duplex **/
#define GMAC_GMAC_NCFGR_FD		(1 << 1)
/** GMAC_GMAC_NCFGR_SPD Speed **/
#define GMAC_GMAC_NCFGR_SPD		(1 << 0)

/**@}*/

/** @defgroup gmac_gmac_nsr GMACNSR Network Status Register
@{*/

/** GMAC_GMAC_NSR_IDLE PHY Management Logic Idle **/
#define GMAC_GMAC_NSR_IDLE		(1 << 2)
/** GMAC_GMAC_NSR_MDIO MDIO Input Status **/
#define GMAC_GMAC_NSR_MDIO		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_ur GMACUR User Register
@{*/

/** GMAC_GMAC_UR_RMII Reduced MII Mode **/
#define GMAC_GMAC_UR_RMII		(1 << 0)

/**@}*/

/** @defgroup gmac_gmac_dcfgr GMACDCFGR DMA Configuration Register
@{*/

/** GMAC_GMAC_DCFGR_DDRP DMA Discard Receive Packets **/
#define GMAC_GMAC_DCFGR_DDRP		(1 << 24)

#define GMAC_GMAC_DCFGR_DRBS_SHIFT		16
#define GMAC_GMAC_DCFGR_DRBS_MASK		0xff
/** @defgroup gmac_gmac_dcfgr_drbs DRBS DMA Receive Buffer Size
@{*/
/**@}*/

/** GMAC_GMAC_DCFGR_TXCOEN Transmitter Checksum Generation Offload Enable **/
#define GMAC_GMAC_DCFGR_TXCOEN		(1 << 11)
/** GMAC_GMAC_DCFGR_TXPBMS Transmitter Packet Buffer Memory Size Select **/
#define GMAC_GMAC_DCFGR_TXPBMS		(1 << 10)

#define GMAC_GMAC_DCFGR_RXBMS_SHIFT		8
#define GMAC_GMAC_DCFGR_RXBMS_MASK		0x03
/** @defgroup gmac_gmac_dcfgr_rxbms RXBMS Receiver Packet Buffer Memory Size Select
@{*/
/**@}*/

/** GMAC_GMAC_DCFGR_ESPA Endian Swap Mode Enable for Packet Data Accesses **/
#define GMAC_GMAC_DCFGR_ESPA		(1 << 7)
/** GMAC_GMAC_DCFGR_ESMA Endian Swap Mode Enable for Management Descriptor Accesses **/
#define GMAC_GMAC_DCFGR_ESMA		(1 << 6)

#define GMAC_GMAC_DCFGR_FBLDO_SHIFT		0
#define GMAC_GMAC_DCFGR_FBLDO_MASK		0x1f
/** @defgroup gmac_gmac_dcfgr_fbldo FBLDO Fixed Burst Length for DMA Data Operations:
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tsr GMACTSR Transmit Status Register
@{*/

/** GMAC_GMAC_TSR_HRESP HRESP Not OK **/
#define GMAC_GMAC_TSR_HRESP		(1 << 8)
/** GMAC_GMAC_TSR_TXCOMP Transmit Complete **/
#define GMAC_GMAC_TSR_TXCOMP		(1 << 5)
/** GMAC_GMAC_TSR_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_TSR_TFC		(1 << 4)
/** GMAC_GMAC_TSR_TXGO Transmit Go **/
#define GMAC_GMAC_TSR_TXGO		(1 << 3)
/** GMAC_GMAC_TSR_RLE Retry Limit Exceeded **/
#define GMAC_GMAC_TSR_RLE		(1 << 2)
/** GMAC_GMAC_TSR_COL Collision Occurred **/
#define GMAC_GMAC_TSR_COL		(1 << 1)
/** GMAC_GMAC_TSR_UBR Used Bit Read **/
#define GMAC_GMAC_TSR_UBR		(1 << 0)

/**@}*/

/** @defgroup gmac_gmac_rbqb GMACRBQB Receive Buffer Queue Base Address Register
@{*/


#define GMAC_GMAC_RBQB_ADDR_SHIFT		2
#define GMAC_GMAC_RBQB_ADDR_MASK		0x3fffffff
/** @defgroup gmac_gmac_rbqb_addr ADDR Receive Buffer Queue Base Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbqb GMACTBQB Transmit Buffer Queue Base Address Register
@{*/


