grevaillot/svd_tools/headers/ATSAMV71J19/gmac.h
#define GMAC_GMAC_TBQB_ADDR_SHIFT		2
#define GMAC_GMAC_TBQB_ADDR_MASK		0x3fffffff
/** @defgroup gmac_gmac_tbqb_addr ADDR Transmit Buffer Queue Base Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rsr GMACRSR Receive Status Register
@{*/

/** GMAC_GMAC_RSR_HNO HRESP Not OK **/
#define GMAC_GMAC_RSR_HNO		(1 << 3)
/** GMAC_GMAC_RSR_RXOVR Receive Overrun **/
#define GMAC_GMAC_RSR_RXOVR		(1 << 2)
/** GMAC_GMAC_RSR_REC Frame Received **/
#define GMAC_GMAC_RSR_REC		(1 << 1)
/** GMAC_GMAC_RSR_BNA Buffer Not Available **/
#define GMAC_GMAC_RSR_BNA		(1 << 0)

/**@}*/

/** @defgroup gmac_gmac_isr GMACISR Interrupt Status Register
@{*/

/** GMAC_GMAC_ISR_WOL Wake On LAN **/
#define GMAC_GMAC_ISR_WOL		(1 << 28)
/** GMAC_GMAC_ISR_SRI TSU Seconds Register Increment **/
#define GMAC_GMAC_ISR_SRI		(1 << 26)
/** GMAC_GMAC_ISR_PDRSFT PDelay Response Frame Transmitted **/
#define GMAC_GMAC_ISR_PDRSFT		(1 << 25)
/** GMAC_GMAC_ISR_PDRQFT PDelay Request Frame Transmitted **/
#define GMAC_GMAC_ISR_PDRQFT		(1 << 24)
/** GMAC_GMAC_ISR_PDRSFR PDelay Response Frame Received **/
#define GMAC_GMAC_ISR_PDRSFR		(1 << 23)
/** GMAC_GMAC_ISR_PDRQFR PDelay Request Frame Received **/
#define GMAC_GMAC_ISR_PDRQFR		(1 << 22)
/** GMAC_GMAC_ISR_SFT PTP Sync Frame Transmitted **/
#define GMAC_GMAC_ISR_SFT		(1 << 21)
/** GMAC_GMAC_ISR_DRQFT PTP Delay Request Frame Transmitted **/
#define GMAC_GMAC_ISR_DRQFT		(1 << 20)
/** GMAC_GMAC_ISR_SFR PTP Sync Frame Received **/
#define GMAC_GMAC_ISR_SFR		(1 << 19)
/** GMAC_GMAC_ISR_DRQFR PTP Delay Request Frame Received **/
#define GMAC_GMAC_ISR_DRQFR		(1 << 18)
/** GMAC_GMAC_ISR_PFTR Pause Frame Transmitted **/
#define GMAC_GMAC_ISR_PFTR		(1 << 14)
/** GMAC_GMAC_ISR_PTZ Pause Time Zero **/
#define GMAC_GMAC_ISR_PTZ		(1 << 13)
/** GMAC_GMAC_ISR_PFNZ Pause Frame with Non-zero Pause Quantum Received **/
#define GMAC_GMAC_ISR_PFNZ		(1 << 12)
/** GMAC_GMAC_ISR_HRESP HRESP Not OK **/
#define GMAC_GMAC_ISR_HRESP		(1 << 11)
/** GMAC_GMAC_ISR_ROVR Receive Overrun **/
#define GMAC_GMAC_ISR_ROVR		(1 << 10)
/** GMAC_GMAC_ISR_TCOMP Transmit Complete **/
#define GMAC_GMAC_ISR_TCOMP		(1 << 7)
/** GMAC_GMAC_ISR_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_ISR_TFC		(1 << 6)
/** GMAC_GMAC_ISR_RLEX Retry Limit Exceeded **/
#define GMAC_GMAC_ISR_RLEX		(1 << 5)
/** GMAC_GMAC_ISR_TUR Transmit Underrun **/
#define GMAC_GMAC_ISR_TUR		(1 << 4)
/** GMAC_GMAC_ISR_TXUBR TX Used Bit Read **/
#define GMAC_GMAC_ISR_TXUBR		(1 << 3)
/** GMAC_GMAC_ISR_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_ISR_RXUBR		(1 << 2)
/** GMAC_GMAC_ISR_RCOMP Receive Complete **/
#define GMAC_GMAC_ISR_RCOMP		(1 << 1)
/** GMAC_GMAC_ISR_MFS Management Frame Sent **/
#define GMAC_GMAC_ISR_MFS		(1 << 0)

/**@}*/

/** @defgroup gmac_gmac_ier GMACIER Interrupt Enable Register
@{*/

/** GMAC_GMAC_IER_TSUTIMCOMP TSU Timer Comparison **/
#define GMAC_GMAC_IER_TSUTIMCOMP		(1 << 29)
/** GMAC_GMAC_IER_WOL Wake On LAN **/
#define GMAC_GMAC_IER_WOL		(1 << 28)
/** GMAC_GMAC_IER_RXLPISBC Enable RX LPI Indication **/
#define GMAC_GMAC_IER_RXLPISBC		(1 << 27)
/** GMAC_GMAC_IER_SRI TSU Seconds Register Increment **/
#define GMAC_GMAC_IER_SRI		(1 << 26)
/** GMAC_GMAC_IER_PDRSFT PDelay Response Frame Transmitted **/
#define GMAC_GMAC_IER_PDRSFT		(1 << 25)
/** GMAC_GMAC_IER_PDRQFT PDelay Request Frame Transmitted **/
#define GMAC_GMAC_IER_PDRQFT		(1 << 24)
/** GMAC_GMAC_IER_PDRSFR PDelay Response Frame Received **/
#define GMAC_GMAC_IER_PDRSFR		(1 << 23)
/** GMAC_GMAC_IER_PDRQFR PDelay Request Frame Received **/
#define GMAC_GMAC_IER_PDRQFR		(1 << 22)
/** GMAC_GMAC_IER_SFT PTP Sync Frame Transmitted **/
#define GMAC_GMAC_IER_SFT		(1 << 21)
/** GMAC_GMAC_IER_DRQFT PTP Delay Request Frame Transmitted **/
#define GMAC_GMAC_IER_DRQFT		(1 << 20)
/** GMAC_GMAC_IER_SFR PTP Sync Frame Received **/
#define GMAC_GMAC_IER_SFR		(1 << 19)
/** GMAC_GMAC_IER_DRQFR PTP Delay Request Frame Received **/
#define GMAC_GMAC_IER_DRQFR		(1 << 18)
/** GMAC_GMAC_IER_EXINT External Interrupt **/
#define GMAC_GMAC_IER_EXINT		(1 << 15)
/** GMAC_GMAC_IER_PFTR Pause Frame Transmitted **/
#define GMAC_GMAC_IER_PFTR		(1 << 14)
/** GMAC_GMAC_IER_PTZ Pause Time Zero **/
#define GMAC_GMAC_IER_PTZ		(1 << 13)
/** GMAC_GMAC_IER_PFNZ Pause Frame with Non-zero Pause Quantum Received **/
#define GMAC_GMAC_IER_PFNZ		(1 << 12)
/** GMAC_GMAC_IER_HRESP HRESP Not OK **/
#define GMAC_GMAC_IER_HRESP		(1 << 11)
/** GMAC_GMAC_IER_ROVR Receive Overrun **/
#define GMAC_GMAC_IER_ROVR		(1 << 10)
/** GMAC_GMAC_IER_TCOMP Transmit Complete **/
#define GMAC_GMAC_IER_TCOMP		(1 << 7)
/** GMAC_GMAC_IER_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IER_TFC		(1 << 6)
/** GMAC_GMAC_IER_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IER_RLEX		(1 << 5)
/** GMAC_GMAC_IER_TUR Transmit Underrun **/
#define GMAC_GMAC_IER_TUR		(1 << 4)
/** GMAC_GMAC_IER_TXUBR TX Used Bit Read **/
#define GMAC_GMAC_IER_TXUBR		(1 << 3)
/** GMAC_GMAC_IER_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IER_RXUBR		(1 << 2)
/** GMAC_GMAC_IER_RCOMP Receive Complete **/
#define GMAC_GMAC_IER_RCOMP		(1 << 1)
/** GMAC_GMAC_IER_MFS Management Frame Sent **/
#define GMAC_GMAC_IER_MFS		(1 << 0)

/**@}*/

/** @defgroup gmac_gmac_idr GMACIDR Interrupt Disable Register
@{*/

/** GMAC_GMAC_IDR_TSUTIMCOMP TSU Timer Comparison **/
#define GMAC_GMAC_IDR_TSUTIMCOMP		(1 << 29)
/** GMAC_GMAC_IDR_WOL Wake On LAN **/
#define GMAC_GMAC_IDR_WOL		(1 << 28)
/** GMAC_GMAC_IDR_RXLPISBC Enable RX LPI Indication **/
#define GMAC_GMAC_IDR_RXLPISBC		(1 << 27)
/** GMAC_GMAC_IDR_SRI TSU Seconds Register Increment **/
#define GMAC_GMAC_IDR_SRI		(1 << 26)
/** GMAC_GMAC_IDR_PDRSFT PDelay Response Frame Transmitted **/
#define GMAC_GMAC_IDR_PDRSFT		(1 << 25)
/** GMAC_GMAC_IDR_PDRQFT PDelay Request Frame Transmitted **/
#define GMAC_GMAC_IDR_PDRQFT		(1 << 24)
/** GMAC_GMAC_IDR_PDRSFR PDelay Response Frame Received **/
#define GMAC_GMAC_IDR_PDRSFR		(1 << 23)
/** GMAC_GMAC_IDR_PDRQFR PDelay Request Frame Received **/
#define GMAC_GMAC_IDR_PDRQFR		(1 << 22)
/** GMAC_GMAC_IDR_SFT PTP Sync Frame Transmitted **/
#define GMAC_GMAC_IDR_SFT		(1 << 21)
/** GMAC_GMAC_IDR_DRQFT PTP Delay Request Frame Transmitted **/
#define GMAC_GMAC_IDR_DRQFT		(1 << 20)
/** GMAC_GMAC_IDR_SFR PTP Sync Frame Received **/
#define GMAC_GMAC_IDR_SFR		(1 << 19)
/** GMAC_GMAC_IDR_DRQFR PTP Delay Request Frame Received **/
#define GMAC_GMAC_IDR_DRQFR		(1 << 18)
/** GMAC_GMAC_IDR_EXINT External Interrupt **/
#define GMAC_GMAC_IDR_EXINT		(1 << 15)
/** GMAC_GMAC_IDR_PFTR Pause Frame Transmitted **/
#define GMAC_GMAC_IDR_PFTR		(1 << 14)
/** GMAC_GMAC_IDR_PTZ Pause Time Zero **/
#define GMAC_GMAC_IDR_PTZ		(1 << 13)
/** GMAC_GMAC_IDR_PFNZ Pause Frame with Non-zero Pause Quantum Received **/
#define GMAC_GMAC_IDR_PFNZ		(1 << 12)
/** GMAC_GMAC_IDR_HRESP HRESP Not OK **/
#define GMAC_GMAC_IDR_HRESP		(1 << 11)
/** GMAC_GMAC_IDR_ROVR Receive Overrun **/
#define GMAC_GMAC_IDR_ROVR		(1 << 10)
/** GMAC_GMAC_IDR_TCOMP Transmit Complete **/
#define GMAC_GMAC_IDR_TCOMP		(1 << 7)
/** GMAC_GMAC_IDR_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IDR_TFC		(1 << 6)
/** GMAC_GMAC_IDR_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IDR_RLEX		(1 << 5)
/** GMAC_GMAC_IDR_TUR Transmit Underrun **/
#define GMAC_GMAC_IDR_TUR		(1 << 4)
/** GMAC_GMAC_IDR_TXUBR TX Used Bit Read **/
#define GMAC_GMAC_IDR_TXUBR		(1 << 3)
/** GMAC_GMAC_IDR_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IDR_RXUBR		(1 << 2)
/** GMAC_GMAC_IDR_RCOMP Receive Complete **/
#define GMAC_GMAC_IDR_RCOMP		(1 << 1)
/** GMAC_GMAC_IDR_MFS Management Frame Sent **/
#define GMAC_GMAC_IDR_MFS		(1 << 0)

/**@}*/

/** @defgroup gmac_gmac_imr GMACIMR Interrupt Mask Register
@{*/

/** GMAC_GMAC_IMR_TSUTIMCOMP TSU Timer Comparison **/
#define GMAC_GMAC_IMR_TSUTIMCOMP		(1 << 29)
/** GMAC_GMAC_IMR_WOL Wake On LAN **/
#define GMAC_GMAC_IMR_WOL		(1 << 28)
/** GMAC_GMAC_IMR_RXLPISBC Enable RX LPI Indication **/
#define GMAC_GMAC_IMR_RXLPISBC		(1 << 27)
/** GMAC_GMAC_IMR_SRI TSU Seconds Register Increment **/
#define GMAC_GMAC_IMR_SRI		(1 << 26)
/** GMAC_GMAC_IMR_PDRSFT PDelay Response Frame Transmitted **/
#define GMAC_GMAC_IMR_PDRSFT		(1 << 25)
/** GMAC_GMAC_IMR_PDRQFT PDelay Request Frame Transmitted **/
#define GMAC_GMAC_IMR_PDRQFT		(1 << 24)
/** GMAC_GMAC_IMR_PDRSFR PDelay Response Frame Received **/
#define GMAC_GMAC_IMR_PDRSFR		(1 << 23)
/** GMAC_GMAC_IMR_PDRQFR PDelay Request Frame Received **/
#define GMAC_GMAC_IMR_PDRQFR		(1 << 22)
/** GMAC_GMAC_IMR_SFT PTP Sync Frame Transmitted **/
#define GMAC_GMAC_IMR_SFT		(1 << 21)
/** GMAC_GMAC_IMR_DRQFT PTP Delay Request Frame Transmitted **/
#define GMAC_GMAC_IMR_DRQFT		(1 << 20)
/** GMAC_GMAC_IMR_SFR PTP Sync Frame Received **/
#define GMAC_GMAC_IMR_SFR		(1 << 19)
/** GMAC_GMAC_IMR_DRQFR PTP Delay Request Frame Received **/
#define GMAC_GMAC_IMR_DRQFR		(1 << 18)
/** GMAC_GMAC_IMR_EXINT External Interrupt **/
#define GMAC_GMAC_IMR_EXINT		(1 << 15)
/** GMAC_GMAC_IMR_PFTR Pause Frame Transmitted **/
#define GMAC_GMAC_IMR_PFTR		(1 << 14)
/** GMAC_GMAC_IMR_PTZ Pause Time Zero **/
#define GMAC_GMAC_IMR_PTZ		(1 << 13)
/** GMAC_GMAC_IMR_PFNZ Pause Frame with Non-zero Pause Quantum Received **/
#define GMAC_GMAC_IMR_PFNZ		(1 << 12)
/** GMAC_GMAC_IMR_HRESP HRESP Not OK **/
#define GMAC_GMAC_IMR_HRESP		(1 << 11)
/** GMAC_GMAC_IMR_ROVR Receive Overrun **/
#define GMAC_GMAC_IMR_ROVR		(1 << 10)
/** GMAC_GMAC_IMR_TCOMP Transmit Complete **/
#define GMAC_GMAC_IMR_TCOMP		(1 << 7)
/** GMAC_GMAC_IMR_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IMR_TFC		(1 << 6)
/** GMAC_GMAC_IMR_RLEX Retry Limit Exceeded **/
#define GMAC_GMAC_IMR_RLEX		(1 << 5)
/** GMAC_GMAC_IMR_TUR Transmit Underrun **/
#define GMAC_GMAC_IMR_TUR		(1 << 4)
/** GMAC_GMAC_IMR_TXUBR TX Used Bit Read **/
#define GMAC_GMAC_IMR_TXUBR		(1 << 3)
/** GMAC_GMAC_IMR_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IMR_RXUBR		(1 << 2)
/** GMAC_GMAC_IMR_RCOMP Receive Complete **/
#define GMAC_GMAC_IMR_RCOMP		(1 << 1)
/** GMAC_GMAC_IMR_MFS Management Frame Sent **/
#define GMAC_GMAC_IMR_MFS		(1 << 0)

/**@}*/

/** @defgroup gmac_gmac_man GMACMAN PHY Maintenance Register
@{*/

