grevaillot/svd_tools/headers/ATSAMV71J19/gmac.h
/** GMAC_GMAC_TIDM4_ENID4 Enable Copying of TID Matched Frames **/
#define GMAC_GMAC_TIDM4_ENID4		(1 << 31)

#define GMAC_GMAC_TIDM4_TID_SHIFT		0
#define GMAC_GMAC_TIDM4_TID_MASK		0xffff
/** @defgroup gmac_gmac_tidm4_tid TID Type ID Match 4
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_wol GMACWOL Wake on LAN Register
@{*/

/** GMAC_GMAC_WOL_MTI Multicast Hash Event Enable **/
#define GMAC_GMAC_WOL_MTI		(1 << 19)
/** GMAC_GMAC_WOL_SA1 Specific Address Register 1 Event Enable **/
#define GMAC_GMAC_WOL_SA1		(1 << 18)
/** GMAC_GMAC_WOL_ARP ARP Request IP Address **/
#define GMAC_GMAC_WOL_ARP		(1 << 17)
/** GMAC_GMAC_WOL_MAG Magic Packet Event Enable **/
#define GMAC_GMAC_WOL_MAG		(1 << 16)

#define GMAC_GMAC_WOL_IP_SHIFT		0
#define GMAC_GMAC_WOL_IP_MASK		0xffff
/** @defgroup gmac_gmac_wol_ip IP ARP Request IP Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ipgs GMACIPGS IPG Stretch Register
@{*/


#define GMAC_GMAC_IPGS_FL_SHIFT		0
#define GMAC_GMAC_IPGS_FL_MASK		0xffff
/** @defgroup gmac_gmac_ipgs_fl FL Frame Length
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_svlan GMACSVLAN Stacked VLAN Register
@{*/

/** GMAC_GMAC_SVLAN_ESVLAN Enable Stacked VLAN Processing Mode **/
#define GMAC_GMAC_SVLAN_ESVLAN		(1 << 31)

#define GMAC_GMAC_SVLAN_VLAN_TYPE_SHIFT		0
#define GMAC_GMAC_SVLAN_VLAN_TYPE_MASK		0xffff
/** @defgroup gmac_gmac_svlan_vlan_type VLANTYPE User Defined VLAN_TYPE Field
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tpfcp GMACTPFCP Transmit PFC Pause Register
@{*/


#define GMAC_GMAC_TPFCP_PQ_SHIFT		8
#define GMAC_GMAC_TPFCP_PQ_MASK		0xff
/** @defgroup gmac_gmac_tpfcp_pq PQ Pause Quantum
@{*/
/**@}*/


#define GMAC_GMAC_TPFCP_PEV_SHIFT		0
#define GMAC_GMAC_TPFCP_PEV_MASK		0xff
/** @defgroup gmac_gmac_tpfcp_pev PEV Priority Enable Vector
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_samb1 GMACSAMB1 Specific Address 1 Mask Bottom Register
@{*/


#define GMAC_GMAC_SAMB1_ADDR_SHIFT		0
#define GMAC_GMAC_SAMB1_ADDR_MASK		0xffffffff
/** @defgroup gmac_gmac_samb1_addr ADDR Specific Address 1 Mask
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_samt1 GMACSAMT1 Specific Address 1 Mask Top Register
@{*/


#define GMAC_GMAC_SAMT1_ADDR_SHIFT		0
#define GMAC_GMAC_SAMT1_ADDR_MASK		0xffff
/** @defgroup gmac_gmac_samt1_addr ADDR Specific Address 1 Mask
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_nsc GMACNSC 1588 Timer Nanosecond Comparison Register
@{*/


#define GMAC_GMAC_NSC_NANOSEC_SHIFT		0
#define GMAC_GMAC_NSC_NANOSEC_MASK		0x3fffff
/** @defgroup gmac_gmac_nsc_nanosec NANOSEC 1588 Timer Nanosecond Comparison Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_scl GMACSCL 1588 Timer Second Comparison Low Register
@{*/


#define GMAC_GMAC_SCL_SEC_SHIFT		0
#define GMAC_GMAC_SCL_SEC_MASK		0xffffffff
/** @defgroup gmac_gmac_scl_sec SEC 1588 Timer Second Comparison Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_sch GMACSCH 1588 Timer Second Comparison High Register
@{*/


#define GMAC_GMAC_SCH_SEC_SHIFT		0
#define GMAC_GMAC_SCH_SEC_MASK		0xffff
/** @defgroup gmac_gmac_sch_sec SEC 1588 Timer Second Comparison Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_eftsh GMACEFTSH PTP Event Frame Transmitted Seconds High Register
@{*/


#define GMAC_GMAC_EFTSH_RUD_SHIFT		0
#define GMAC_GMAC_EFTSH_RUD_MASK		0xffff
/** @defgroup gmac_gmac_eftsh_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_efrsh GMACEFRSH PTP Event Frame Received Seconds High Register
@{*/


#define GMAC_GMAC_EFRSH_RUD_SHIFT		0
#define GMAC_GMAC_EFRSH_RUD_MASK		0xffff
/** @defgroup gmac_gmac_efrsh_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_peftsh GMACPEFTSH PTP Peer Event Frame Transmitted Seconds High Register
@{*/


#define GMAC_GMAC_PEFTSH_RUD_SHIFT		0
#define GMAC_GMAC_PEFTSH_RUD_MASK		0xffff
/** @defgroup gmac_gmac_peftsh_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_pefrsh GMACPEFRSH PTP Peer Event Frame Received Seconds High Register
@{*/


#define GMAC_GMAC_PEFRSH_RUD_SHIFT		0
#define GMAC_GMAC_PEFRSH_RUD_MASK		0xffff
/** @defgroup gmac_gmac_pefrsh_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_mid GMACMID Module ID Register
@{*/


#define GMAC_GMAC_MID_MID_SHIFT		16
#define GMAC_GMAC_MID_MID_MASK		0xffff
/** @defgroup gmac_gmac_mid_mid MID Module Identification Number
@{*/
/**@}*/


#define GMAC_GMAC_MID_MREV_SHIFT		0
#define GMAC_GMAC_MID_MREV_MASK		0xffff
/** @defgroup gmac_gmac_mid_mrev MREV Module Revision
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_otlo GMACOTLO Octets Transmitted Low Register
@{*/


#define GMAC_GMAC_OTLO_TXO_SHIFT		0
#define GMAC_GMAC_OTLO_TXO_MASK		0xffffffff
/** @defgroup gmac_gmac_otlo_txo TXO Transmitted Octets
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_othi GMACOTHI Octets Transmitted High Register
@{*/


#define GMAC_GMAC_OTHI_TXO_SHIFT		0
#define GMAC_GMAC_OTHI_TXO_MASK		0xffff
/** @defgroup gmac_gmac_othi_txo TXO Transmitted Octets
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ft GMACFT Frames Transmitted Register
@{*/


#define GMAC_GMAC_FT_FTX_SHIFT		0
#define GMAC_GMAC_FT_FTX_MASK		0xffffffff
/** @defgroup gmac_gmac_ft_ftx FTX Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_bcft GMACBCFT Broadcast Frames Transmitted Register
@{*/


#define GMAC_GMAC_BCFT_BFTX_SHIFT		0
#define GMAC_GMAC_BCFT_BFTX_MASK		0xffffffff
/** @defgroup gmac_gmac_bcft_bftx BFTX Broadcast Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_mft GMACMFT Multicast Frames Transmitted Register
@{*/


#define GMAC_GMAC_MFT_MFTX_SHIFT		0
#define GMAC_GMAC_MFT_MFTX_MASK		0xffffffff
/** @defgroup gmac_gmac_mft_mftx MFTX Multicast Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_pft GMACPFT Pause Frames Transmitted Register
@{*/


#define GMAC_GMAC_PFT_PFTX_SHIFT		0
#define GMAC_GMAC_PFT_PFTX_MASK		0xffff
/** @defgroup gmac_gmac_pft_pftx PFTX Pause Frames Transmitted Register
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_bft64 GMACBFT64 64 Byte Frames Transmitted Register
@{*/


