grevaillot/svd_tools/headers/ATSAMV71J19/gmac.h
#define GMAC_GMAC_BFT64_NFTX_SHIFT		0
#define GMAC_GMAC_BFT64_NFTX_MASK		0xffffffff
/** @defgroup gmac_gmac_bft64_nftx NFTX 64 Byte Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbft127 GMACTBFT127 65 to 127 Byte Frames Transmitted Register
@{*/


#define GMAC_GMAC_TBFT127_NFTX_SHIFT		0
#define GMAC_GMAC_TBFT127_NFTX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbft127_nftx NFTX 65 to 127 Byte Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbft255 GMACTBFT255 128 to 255 Byte Frames Transmitted Register
@{*/


#define GMAC_GMAC_TBFT255_NFTX_SHIFT		0
#define GMAC_GMAC_TBFT255_NFTX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbft255_nftx NFTX 128 to 255 Byte Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbft511 GMACTBFT511 256 to 511 Byte Frames Transmitted Register
@{*/


#define GMAC_GMAC_TBFT511_NFTX_SHIFT		0
#define GMAC_GMAC_TBFT511_NFTX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbft511_nftx NFTX 256 to 511 Byte Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbft1023 GMACTBFT1023 512 to 1023 Byte Frames Transmitted Register
@{*/


#define GMAC_GMAC_TBFT1023_NFTX_SHIFT		0
#define GMAC_GMAC_TBFT1023_NFTX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbft1023_nftx NFTX 512 to 1023 Byte Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbft1518 GMACTBFT1518 1024 to 1518 Byte Frames Transmitted Register
@{*/


#define GMAC_GMAC_TBFT1518_NFTX_SHIFT		0
#define GMAC_GMAC_TBFT1518_NFTX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbft1518_nftx NFTX 1024 to 1518 Byte Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_gtbft1518 GMACGTBFT1518 Greater Than 1518 Byte Frames Transmitted Register
@{*/


#define GMAC_GMAC_GTBFT1518_NFTX_SHIFT		0
#define GMAC_GMAC_GTBFT1518_NFTX_MASK		0xffffffff
/** @defgroup gmac_gmac_gtbft1518_nftx NFTX Greater than 1518 Byte Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tur GMACTUR Transmit Underruns Register
@{*/


#define GMAC_GMAC_TUR_TXUNR_SHIFT		0
#define GMAC_GMAC_TUR_TXUNR_MASK		0x3ff
/** @defgroup gmac_gmac_tur_txunr TXUNR Transmit Underruns
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_scf GMACSCF Single Collision Frames Register
@{*/


#define GMAC_GMAC_SCF_SCOL_SHIFT		0
#define GMAC_GMAC_SCF_SCOL_MASK		0x3ffff
/** @defgroup gmac_gmac_scf_scol SCOL Single Collision
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_mcf GMACMCF Multiple Collision Frames Register
@{*/


#define GMAC_GMAC_MCF_MCOL_SHIFT		0
#define GMAC_GMAC_MCF_MCOL_MASK		0x3ffff
/** @defgroup gmac_gmac_mcf_mcol MCOL Multiple Collision
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ec GMACEC Excessive Collisions Register
@{*/


#define GMAC_GMAC_EC_XCOL_SHIFT		0
#define GMAC_GMAC_EC_XCOL_MASK		0x3ff
/** @defgroup gmac_gmac_ec_xcol XCOL Excessive Collisions
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_lc GMACLC Late Collisions Register
@{*/


#define GMAC_GMAC_LC_LCOL_SHIFT		0
#define GMAC_GMAC_LC_LCOL_MASK		0x3ff
/** @defgroup gmac_gmac_lc_lcol LCOL Late Collisions
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_dtf GMACDTF Deferred Transmission Frames Register
@{*/


#define GMAC_GMAC_DTF_DEFT_SHIFT		0
#define GMAC_GMAC_DTF_DEFT_MASK		0x3ffff
/** @defgroup gmac_gmac_dtf_deft DEFT Deferred Transmission
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_cse GMACCSE Carrier Sense Errors Register
@{*/


#define GMAC_GMAC_CSE_CSR_SHIFT		0
#define GMAC_GMAC_CSE_CSR_MASK		0x3ff
/** @defgroup gmac_gmac_cse_csr CSR Carrier Sense Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_orlo GMACORLO Octets Received Low Received Register
@{*/


#define GMAC_GMAC_ORLO_RXO_SHIFT		0
#define GMAC_GMAC_ORLO_RXO_MASK		0xffffffff
/** @defgroup gmac_gmac_orlo_rxo RXO Received Octets
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_orhi GMACORHI Octets Received High Received Register
@{*/


#define GMAC_GMAC_ORHI_RXO_SHIFT		0
#define GMAC_GMAC_ORHI_RXO_MASK		0xffff
/** @defgroup gmac_gmac_orhi_rxo RXO Received Octets
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_fr GMACFR Frames Received Register
@{*/


#define GMAC_GMAC_FR_FRX_SHIFT		0
#define GMAC_GMAC_FR_FRX_MASK		0xffffffff
/** @defgroup gmac_gmac_fr_frx FRX Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_bcfr GMACBCFR Broadcast Frames Received Register
@{*/


#define GMAC_GMAC_BCFR_BFRX_SHIFT		0
#define GMAC_GMAC_BCFR_BFRX_MASK		0xffffffff
/** @defgroup gmac_gmac_bcfr_bfrx BFRX Broadcast Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_mfr GMACMFR Multicast Frames Received Register
@{*/


#define GMAC_GMAC_MFR_MFRX_SHIFT		0
#define GMAC_GMAC_MFR_MFRX_MASK		0xffffffff
/** @defgroup gmac_gmac_mfr_mfrx MFRX Multicast Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_pfr GMACPFR Pause Frames Received Register
@{*/


#define GMAC_GMAC_PFR_PFRX_SHIFT		0
#define GMAC_GMAC_PFR_PFRX_MASK		0xffff
/** @defgroup gmac_gmac_pfr_pfrx PFRX Pause Frames Received Register
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_bfr64 GMACBFR64 64 Byte Frames Received Register
@{*/


#define GMAC_GMAC_BFR64_NFRX_SHIFT		0
#define GMAC_GMAC_BFR64_NFRX_MASK		0xffffffff
/** @defgroup gmac_gmac_bfr64_nfrx NFRX 64 Byte Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbfr127 GMACTBFR127 65 to 127 Byte Frames Received Register
@{*/


#define GMAC_GMAC_TBFR127_NFRX_SHIFT		0
#define GMAC_GMAC_TBFR127_NFRX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbfr127_nfrx NFRX 65 to 127 Byte Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbfr255 GMACTBFR255 128 to 255 Byte Frames Received Register
@{*/


#define GMAC_GMAC_TBFR255_NFRX_SHIFT		0
#define GMAC_GMAC_TBFR255_NFRX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbfr255_nfrx NFRX 128 to 255 Byte Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbfr511 GMACTBFR511 256 to 511 Byte Frames Received Register
@{*/


#define GMAC_GMAC_TBFR511_NFRX_SHIFT		0
#define GMAC_GMAC_TBFR511_NFRX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbfr511_nfrx NFRX 256 to 511 Byte Frames Received without Error
@{*/
/**@}*/


/**@}*/

