grevaillot/svd_tools/headers/ATSAMV71J19/gmac.h
/** @defgroup gmac_gmac_tbfr1023 GMACTBFR1023 512 to 1023 Byte Frames Received Register
@{*/


#define GMAC_GMAC_TBFR1023_NFRX_SHIFT		0
#define GMAC_GMAC_TBFR1023_NFRX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbfr1023_nfrx NFRX 512 to 1023 Byte Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbfr1518 GMACTBFR1518 1024 to 1518 Byte Frames Received Register
@{*/


#define GMAC_GMAC_TBFR1518_NFRX_SHIFT		0
#define GMAC_GMAC_TBFR1518_NFRX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbfr1518_nfrx NFRX 1024 to 1518 Byte Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tmxbfr GMACTMXBFR 1519 to Maximum Byte Frames Received Register
@{*/


#define GMAC_GMAC_TMXBFR_NFRX_SHIFT		0
#define GMAC_GMAC_TMXBFR_NFRX_MASK		0xffffffff
/** @defgroup gmac_gmac_tmxbfr_nfrx NFRX 1519 to Maximum Byte Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ufr GMACUFR Undersize Frames Received Register
@{*/


#define GMAC_GMAC_UFR_UFRX_SHIFT		0
#define GMAC_GMAC_UFR_UFRX_MASK		0x3ff
/** @defgroup gmac_gmac_ufr_ufrx UFRX Undersize Frames Received
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ofr GMACOFR Oversize Frames Received Register
@{*/


#define GMAC_GMAC_OFR_OFRX_SHIFT		0
#define GMAC_GMAC_OFR_OFRX_MASK		0x3ff
/** @defgroup gmac_gmac_ofr_ofrx OFRX Oversized Frames Received
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_jr GMACJR Jabbers Received Register
@{*/


#define GMAC_GMAC_JR_JRX_SHIFT		0
#define GMAC_GMAC_JR_JRX_MASK		0x3ff
/** @defgroup gmac_gmac_jr_jrx JRX Jabbers Received
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_fcse GMACFCSE Frame Check Sequence Errors Register
@{*/


#define GMAC_GMAC_FCSE_FCKR_SHIFT		0
#define GMAC_GMAC_FCSE_FCKR_MASK		0x3ff
/** @defgroup gmac_gmac_fcse_fckr FCKR Frame Check Sequence Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_lffe GMACLFFE Length Field Frame Errors Register
@{*/


#define GMAC_GMAC_LFFE_LFER_SHIFT		0
#define GMAC_GMAC_LFFE_LFER_MASK		0x3ff
/** @defgroup gmac_gmac_lffe_lfer LFER Length Field Frame Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rse GMACRSE Receive Symbol Errors Register
@{*/


#define GMAC_GMAC_RSE_RXSE_SHIFT		0
#define GMAC_GMAC_RSE_RXSE_MASK		0x3ff
/** @defgroup gmac_gmac_rse_rxse RXSE Receive Symbol Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ae GMACAE Alignment Errors Register
@{*/


#define GMAC_GMAC_AE_AER_SHIFT		0
#define GMAC_GMAC_AE_AER_MASK		0x3ff
/** @defgroup gmac_gmac_ae_aer AER Alignment Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rre GMACRRE Receive Resource Errors Register
@{*/


#define GMAC_GMAC_RRE_RXRER_SHIFT		0
#define GMAC_GMAC_RRE_RXRER_MASK		0x3ffff
/** @defgroup gmac_gmac_rre_rxrer RXRER Receive Resource Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_roe GMACROE Receive Overrun Register
@{*/


#define GMAC_GMAC_ROE_RXOVR_SHIFT		0
#define GMAC_GMAC_ROE_RXOVR_MASK		0x3ff
/** @defgroup gmac_gmac_roe_rxovr RXOVR Receive Overruns
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ihce GMACIHCE IP Header Checksum Errors Register
@{*/


#define GMAC_GMAC_IHCE_HCKER_SHIFT		0
#define GMAC_GMAC_IHCE_HCKER_MASK		0xff
/** @defgroup gmac_gmac_ihce_hcker HCKER IP Header Checksum Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tce GMACTCE TCP Checksum Errors Register
@{*/


#define GMAC_GMAC_TCE_TCKER_SHIFT		0
#define GMAC_GMAC_TCE_TCKER_MASK		0xff
/** @defgroup gmac_gmac_tce_tcker TCKER TCP Checksum Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_uce GMACUCE UDP Checksum Errors Register
@{*/


#define GMAC_GMAC_UCE_UCKER_SHIFT		0
#define GMAC_GMAC_UCE_UCKER_MASK		0xff
/** @defgroup gmac_gmac_uce_ucker UCKER UDP Checksum Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tisubn GMACTISUBN 1588 Timer Increment Sub-nanoseconds Register
@{*/


#define GMAC_GMAC_TISUBN_LSBTIR_SHIFT		0
#define GMAC_GMAC_TISUBN_LSBTIR_MASK		0xffff
/** @defgroup gmac_gmac_tisubn_lsbtir LSBTIR Lower Significant Bits of Timer Increment Register
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tsh GMACTSH 1588 Timer Seconds High Register
@{*/


#define GMAC_GMAC_TSH_TCS_SHIFT		0
#define GMAC_GMAC_TSH_TCS_MASK		0xffff
/** @defgroup gmac_gmac_tsh_tcs TCS Timer Count in Seconds
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tsl GMACTSL 1588 Timer Seconds Low Register
@{*/


#define GMAC_GMAC_TSL_TCS_SHIFT		0
#define GMAC_GMAC_TSL_TCS_MASK		0xffffffff
/** @defgroup gmac_gmac_tsl_tcs TCS Timer Count in Seconds
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tn GMACTN 1588 Timer Nanoseconds Register
@{*/


#define GMAC_GMAC_TN_TNS_SHIFT		0
#define GMAC_GMAC_TN_TNS_MASK		0x3fffffff
/** @defgroup gmac_gmac_tn_tns TNS Timer Count in Nanoseconds
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ta GMACTA 1588 Timer Adjust Register
@{*/

/** GMAC_GMAC_TA_ADJ Adjust 1588 Timer **/
#define GMAC_GMAC_TA_ADJ		(1 << 31)

#define GMAC_GMAC_TA_ITDT_SHIFT		0
#define GMAC_GMAC_TA_ITDT_MASK		0x3fffffff
/** @defgroup gmac_gmac_ta_itdt ITDT Increment/Decrement
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ti GMACTI 1588 Timer Increment Register
@{*/


#define GMAC_GMAC_TI_NIT_SHIFT		16
#define GMAC_GMAC_TI_NIT_MASK		0xff
/** @defgroup gmac_gmac_ti_nit NIT Number of Increments
@{*/
/**@}*/


#define GMAC_GMAC_TI_ACNS_SHIFT		8
#define GMAC_GMAC_TI_ACNS_MASK		0xff
/** @defgroup gmac_gmac_ti_acns ACNS Alternative Count Nanoseconds
@{*/
/**@}*/


#define GMAC_GMAC_TI_CNS_SHIFT		0
#define GMAC_GMAC_TI_CNS_MASK		0xff
/** @defgroup gmac_gmac_ti_cns CNS Count Nanoseconds
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_eftsl GMACEFTSL PTP Event Frame Transmitted Seconds Low Register
@{*/


#define GMAC_GMAC_EFTSL_RUD_SHIFT		0
#define GMAC_GMAC_EFTSL_RUD_MASK		0xffffffff
/** @defgroup gmac_gmac_eftsl_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_eftn GMACEFTN PTP Event Frame Transmitted Nanoseconds Register
@{*/


#define GMAC_GMAC_EFTN_RUD_SHIFT		0
#define GMAC_GMAC_EFTN_RUD_MASK		0x3fffffff
/** @defgroup gmac_gmac_eftn_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_efrsl GMACEFRSL PTP Event Frame Received Seconds Low Register
@{*/


#define GMAC_GMAC_EFRSL_RUD_SHIFT		0
#define GMAC_GMAC_EFRSL_RUD_MASK		0xffffffff
/** @defgroup gmac_gmac_efrsl_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_efrn GMACEFRN PTP Event Frame Received Nanoseconds Register
@{*/


#define GMAC_GMAC_EFRN_RUD_SHIFT		0
#define GMAC_GMAC_EFRN_RUD_MASK		0x3fffffff
/** @defgroup gmac_gmac_efrn_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_peftsl GMACPEFTSL PTP Peer Event Frame Transmitted Seconds Low Register
@{*/


#define GMAC_GMAC_PEFTSL_RUD_SHIFT		0
#define GMAC_GMAC_PEFTSL_RUD_MASK		0xffffffff
/** @defgroup gmac_gmac_peftsl_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_peftn GMACPEFTN PTP Peer Event Frame Transmitted Nanoseconds Register
@{*/


#define GMAC_GMAC_PEFTN_RUD_SHIFT		0
#define GMAC_GMAC_PEFTN_RUD_MASK		0x3fffffff
/** @defgroup gmac_gmac_peftn_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_pefrsl GMACPEFRSL PTP Peer Event Frame Received Seconds Low Register
@{*/


#define GMAC_GMAC_PEFRSL_RUD_SHIFT		0
#define GMAC_GMAC_PEFRSL_RUD_MASK		0xffffffff
/** @defgroup gmac_gmac_pefrsl_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_pefrn GMACPEFRN PTP Peer Event Frame Received Nanoseconds Register
@{*/


#define GMAC_GMAC_PEFRN_RUD_SHIFT		0
#define GMAC_GMAC_PEFRN_RUD_MASK		0x3fffffff
/** @defgroup gmac_gmac_pefrn_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

