grevaillot/svd_tools/headers/ATSAMV71J19/gmac.h
/** @defgroup gmac_gmac_isrpq[0] GMACISRPQ[0] Interrupt Status Register Priority Queue (index = 1) 0
@{*/

/** GMAC_GMAC_ISRPQ[0]_HRESP HRESP Not OK **/
#define GMAC_GMAC_ISRPQ[0]_HRESP		(1 << 11)
/** GMAC_GMAC_ISRPQ[0]_ROVR Receive Overrun **/
#define GMAC_GMAC_ISRPQ[0]_ROVR		(1 << 10)
/** GMAC_GMAC_ISRPQ[0]_TCOMP Transmit Complete **/
#define GMAC_GMAC_ISRPQ[0]_TCOMP		(1 << 7)
/** GMAC_GMAC_ISRPQ[0]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_ISRPQ[0]_TFC		(1 << 6)
/** GMAC_GMAC_ISRPQ[0]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_ISRPQ[0]_RLEX		(1 << 5)
/** GMAC_GMAC_ISRPQ[0]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_ISRPQ[0]_RXUBR		(1 << 2)
/** GMAC_GMAC_ISRPQ[0]_RCOMP Receive Complete **/
#define GMAC_GMAC_ISRPQ[0]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_isrpq[1] GMACISRPQ[1] Interrupt Status Register Priority Queue (index = 1) 0
@{*/

/** GMAC_GMAC_ISRPQ[1]_HRESP HRESP Not OK **/
#define GMAC_GMAC_ISRPQ[1]_HRESP		(1 << 11)
/** GMAC_GMAC_ISRPQ[1]_ROVR Receive Overrun **/
#define GMAC_GMAC_ISRPQ[1]_ROVR		(1 << 10)
/** GMAC_GMAC_ISRPQ[1]_TCOMP Transmit Complete **/
#define GMAC_GMAC_ISRPQ[1]_TCOMP		(1 << 7)
/** GMAC_GMAC_ISRPQ[1]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_ISRPQ[1]_TFC		(1 << 6)
/** GMAC_GMAC_ISRPQ[1]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_ISRPQ[1]_RLEX		(1 << 5)
/** GMAC_GMAC_ISRPQ[1]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_ISRPQ[1]_RXUBR		(1 << 2)
/** GMAC_GMAC_ISRPQ[1]_RCOMP Receive Complete **/
#define GMAC_GMAC_ISRPQ[1]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_tbqbapq[0] GMACTBQBAPQ[0] Transmit Buffer Queue Base Address Register Priority Queue (index = 1) 0
@{*/


#define GMAC_GMAC_TBQBAPQ[0]_TXBQBA_SHIFT		2
#define GMAC_GMAC_TBQBAPQ[0]_TXBQBA_MASK		0x3fffffff
/** @defgroup gmac_gmac_tbqbapq[0]_txbqba TXBQBA Transmit Buffer Queue Base Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbqbapq[1] GMACTBQBAPQ[1] Transmit Buffer Queue Base Address Register Priority Queue (index = 1) 0
@{*/


#define GMAC_GMAC_TBQBAPQ[1]_TXBQBA_SHIFT		2
#define GMAC_GMAC_TBQBAPQ[1]_TXBQBA_MASK		0x3fffffff
/** @defgroup gmac_gmac_tbqbapq[1]_txbqba TXBQBA Transmit Buffer Queue Base Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rbqbapq[0] GMACRBQBAPQ[0] Receive Buffer Queue Base Address Register Priority Queue (index = 1) 0
@{*/


#define GMAC_GMAC_RBQBAPQ[0]_RXBQBA_SHIFT		2
#define GMAC_GMAC_RBQBAPQ[0]_RXBQBA_MASK		0x3fffffff
/** @defgroup gmac_gmac_rbqbapq[0]_rxbqba RXBQBA Receive Buffer Queue Base Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rbqbapq[1] GMACRBQBAPQ[1] Receive Buffer Queue Base Address Register Priority Queue (index = 1) 0
@{*/


#define GMAC_GMAC_RBQBAPQ[1]_RXBQBA_SHIFT		2
#define GMAC_GMAC_RBQBAPQ[1]_RXBQBA_MASK		0x3fffffff
/** @defgroup gmac_gmac_rbqbapq[1]_rxbqba RXBQBA Receive Buffer Queue Base Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rbsrpq[0] GMACRBSRPQ[0] Receive Buffer Size Register Priority Queue (index = 1) 0
@{*/


#define GMAC_GMAC_RBSRPQ[0]_RBS_SHIFT		0
#define GMAC_GMAC_RBSRPQ[0]_RBS_MASK		0xffff
/** @defgroup gmac_gmac_rbsrpq[0]_rbs RBS Receive Buffer Size
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rbsrpq[1] GMACRBSRPQ[1] Receive Buffer Size Register Priority Queue (index = 1) 0
@{*/


#define GMAC_GMAC_RBSRPQ[1]_RBS_SHIFT		0
#define GMAC_GMAC_RBSRPQ[1]_RBS_MASK		0xffff
/** @defgroup gmac_gmac_rbsrpq[1]_rbs RBS Receive Buffer Size
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_cbscr GMACCBSCR Credit-Based Shaping Control Register
@{*/

/** GMAC_GMAC_CBSCR_QAE Queue A CBS Enable **/
#define GMAC_GMAC_CBSCR_QAE		(1 << 1)
/** GMAC_GMAC_CBSCR_QBE Queue B CBS Enable **/
#define GMAC_GMAC_CBSCR_QBE		(1 << 0)

/**@}*/

/** @defgroup gmac_gmac_cbsisqa GMACCBSISQA Credit-Based Shaping IdleSlope Register for Queue A
@{*/


#define GMAC_GMAC_CBSISQA_IS_SHIFT		0
#define GMAC_GMAC_CBSISQA_IS_MASK		0xffffffff
/** @defgroup gmac_gmac_cbsisqa_is IS IdleSlope
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_cbsisqb GMACCBSISQB Credit-Based Shaping IdleSlope Register for Queue B
@{*/


#define GMAC_GMAC_CBSISQB_IS_SHIFT		0
#define GMAC_GMAC_CBSISQB_IS_MASK		0xffffffff
/** @defgroup gmac_gmac_cbsisqb_is IS IdleSlope
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st1rpq[0] GMACST1RPQ[0] Screening Type 1 Register Priority Queue (index = 0) 0
@{*/

/** GMAC_GMAC_ST1RPQ[0]_UDPE UDP Port Match Enable **/
#define GMAC_GMAC_ST1RPQ[0]_UDPE		(1 << 29)
/** GMAC_GMAC_ST1RPQ[0]_DSTCE Differentiated Services or Traffic Class Match Enable **/
#define GMAC_GMAC_ST1RPQ[0]_DSTCE		(1 << 28)

#define GMAC_GMAC_ST1RPQ[0]_UDPM_SHIFT		12
#define GMAC_GMAC_ST1RPQ[0]_UDPM_MASK		0xffff
/** @defgroup gmac_gmac_st1rpq[0]_udpm UDPM UDP Port Match
@{*/
/**@}*/


#define GMAC_GMAC_ST1RPQ[0]_DSTCM_SHIFT		4
#define GMAC_GMAC_ST1RPQ[0]_DSTCM_MASK		0xff
/** @defgroup gmac_gmac_st1rpq[0]_dstcm DSTCM Differentiated Services or Traffic Class Match
@{*/
/**@}*/


#define GMAC_GMAC_ST1RPQ[0]_QNB_SHIFT		0
#define GMAC_GMAC_ST1RPQ[0]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st1rpq[0]_qnb QNB Queue Number (0-2)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st1rpq[1] GMACST1RPQ[1] Screening Type 1 Register Priority Queue (index = 0) 0
@{*/

/** GMAC_GMAC_ST1RPQ[1]_UDPE UDP Port Match Enable **/
#define GMAC_GMAC_ST1RPQ[1]_UDPE		(1 << 29)
/** GMAC_GMAC_ST1RPQ[1]_DSTCE Differentiated Services or Traffic Class Match Enable **/
#define GMAC_GMAC_ST1RPQ[1]_DSTCE		(1 << 28)

#define GMAC_GMAC_ST1RPQ[1]_UDPM_SHIFT		12
#define GMAC_GMAC_ST1RPQ[1]_UDPM_MASK		0xffff
/** @defgroup gmac_gmac_st1rpq[1]_udpm UDPM UDP Port Match
@{*/
/**@}*/


#define GMAC_GMAC_ST1RPQ[1]_DSTCM_SHIFT		4
#define GMAC_GMAC_ST1RPQ[1]_DSTCM_MASK		0xff
/** @defgroup gmac_gmac_st1rpq[1]_dstcm DSTCM Differentiated Services or Traffic Class Match
@{*/
/**@}*/


#define GMAC_GMAC_ST1RPQ[1]_QNB_SHIFT		0
#define GMAC_GMAC_ST1RPQ[1]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st1rpq[1]_qnb QNB Queue Number (0-2)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st1rpq[2] GMACST1RPQ[2] Screening Type 1 Register Priority Queue (index = 0) 0
@{*/

