grevaillot/svd_tools/headers/ATSAMV71J19/gmac.h
/** GMAC_GMAC_ST1RPQ[2]_UDPE UDP Port Match Enable **/
#define GMAC_GMAC_ST1RPQ[2]_UDPE		(1 << 29)
/** GMAC_GMAC_ST1RPQ[2]_DSTCE Differentiated Services or Traffic Class Match Enable **/
#define GMAC_GMAC_ST1RPQ[2]_DSTCE		(1 << 28)

#define GMAC_GMAC_ST1RPQ[2]_UDPM_SHIFT		12
#define GMAC_GMAC_ST1RPQ[2]_UDPM_MASK		0xffff
/** @defgroup gmac_gmac_st1rpq[2]_udpm UDPM UDP Port Match
@{*/
/**@}*/


#define GMAC_GMAC_ST1RPQ[2]_DSTCM_SHIFT		4
#define GMAC_GMAC_ST1RPQ[2]_DSTCM_MASK		0xff
/** @defgroup gmac_gmac_st1rpq[2]_dstcm DSTCM Differentiated Services or Traffic Class Match
@{*/
/**@}*/


#define GMAC_GMAC_ST1RPQ[2]_QNB_SHIFT		0
#define GMAC_GMAC_ST1RPQ[2]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st1rpq[2]_qnb QNB Queue Number (0-2)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st1rpq[3] GMACST1RPQ[3] Screening Type 1 Register Priority Queue (index = 0) 0
@{*/

/** GMAC_GMAC_ST1RPQ[3]_UDPE UDP Port Match Enable **/
#define GMAC_GMAC_ST1RPQ[3]_UDPE		(1 << 29)
/** GMAC_GMAC_ST1RPQ[3]_DSTCE Differentiated Services or Traffic Class Match Enable **/
#define GMAC_GMAC_ST1RPQ[3]_DSTCE		(1 << 28)

#define GMAC_GMAC_ST1RPQ[3]_UDPM_SHIFT		12
#define GMAC_GMAC_ST1RPQ[3]_UDPM_MASK		0xffff
/** @defgroup gmac_gmac_st1rpq[3]_udpm UDPM UDP Port Match
@{*/
/**@}*/


#define GMAC_GMAC_ST1RPQ[3]_DSTCM_SHIFT		4
#define GMAC_GMAC_ST1RPQ[3]_DSTCM_MASK		0xff
/** @defgroup gmac_gmac_st1rpq[3]_dstcm DSTCM Differentiated Services or Traffic Class Match
@{*/
/**@}*/


#define GMAC_GMAC_ST1RPQ[3]_QNB_SHIFT		0
#define GMAC_GMAC_ST1RPQ[3]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st1rpq[3]_qnb QNB Queue Number (0-2)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2rpq[0] GMACST2RPQ[0] Screening Type 2 Register Priority Queue (index = 0) 0
@{*/

/** GMAC_GMAC_ST2RPQ[0]_COMPCE Compare C Enable **/
#define GMAC_GMAC_ST2RPQ[0]_COMPCE		(1 << 30)

#define GMAC_GMAC_ST2RPQ[0]_COMPC_SHIFT		25
#define GMAC_GMAC_ST2RPQ[0]_COMPC_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[0]_compc COMPC Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[0]_COMPBE Compare B Enable **/
#define GMAC_GMAC_ST2RPQ[0]_COMPBE		(1 << 24)

#define GMAC_GMAC_ST2RPQ[0]_COMPB_SHIFT		19
#define GMAC_GMAC_ST2RPQ[0]_COMPB_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[0]_compb COMPB Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[0]_COMPAE Compare A Enable **/
#define GMAC_GMAC_ST2RPQ[0]_COMPAE		(1 << 18)

#define GMAC_GMAC_ST2RPQ[0]_COMPA_SHIFT		13
#define GMAC_GMAC_ST2RPQ[0]_COMPA_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[0]_compa COMPA Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[0]_ETHE EtherType Enable **/
#define GMAC_GMAC_ST2RPQ[0]_ETHE		(1 << 12)

#define GMAC_GMAC_ST2RPQ[0]_I2ETH_SHIFT		9
#define GMAC_GMAC_ST2RPQ[0]_I2ETH_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[0]_i2eth I2ETH Index of Screening Type 2 EtherType register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[0]_VLANE VLAN Enable **/
#define GMAC_GMAC_ST2RPQ[0]_VLANE		(1 << 8)

#define GMAC_GMAC_ST2RPQ[0]_VLANP_SHIFT		4
#define GMAC_GMAC_ST2RPQ[0]_VLANP_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[0]_vlanp VLANP VLAN Priority
@{*/
/**@}*/


#define GMAC_GMAC_ST2RPQ[0]_QNB_SHIFT		0
#define GMAC_GMAC_ST2RPQ[0]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[0]_qnb QNB Queue Number (0-2)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2rpq[1] GMACST2RPQ[1] Screening Type 2 Register Priority Queue (index = 0) 0
@{*/

/** GMAC_GMAC_ST2RPQ[1]_COMPCE Compare C Enable **/
#define GMAC_GMAC_ST2RPQ[1]_COMPCE		(1 << 30)

#define GMAC_GMAC_ST2RPQ[1]_COMPC_SHIFT		25
#define GMAC_GMAC_ST2RPQ[1]_COMPC_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[1]_compc COMPC Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[1]_COMPBE Compare B Enable **/
#define GMAC_GMAC_ST2RPQ[1]_COMPBE		(1 << 24)

#define GMAC_GMAC_ST2RPQ[1]_COMPB_SHIFT		19
#define GMAC_GMAC_ST2RPQ[1]_COMPB_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[1]_compb COMPB Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[1]_COMPAE Compare A Enable **/
#define GMAC_GMAC_ST2RPQ[1]_COMPAE		(1 << 18)

#define GMAC_GMAC_ST2RPQ[1]_COMPA_SHIFT		13
#define GMAC_GMAC_ST2RPQ[1]_COMPA_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[1]_compa COMPA Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[1]_ETHE EtherType Enable **/
#define GMAC_GMAC_ST2RPQ[1]_ETHE		(1 << 12)

#define GMAC_GMAC_ST2RPQ[1]_I2ETH_SHIFT		9
#define GMAC_GMAC_ST2RPQ[1]_I2ETH_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[1]_i2eth I2ETH Index of Screening Type 2 EtherType register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[1]_VLANE VLAN Enable **/
#define GMAC_GMAC_ST2RPQ[1]_VLANE		(1 << 8)

#define GMAC_GMAC_ST2RPQ[1]_VLANP_SHIFT		4
#define GMAC_GMAC_ST2RPQ[1]_VLANP_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[1]_vlanp VLANP VLAN Priority
@{*/
/**@}*/


#define GMAC_GMAC_ST2RPQ[1]_QNB_SHIFT		0
#define GMAC_GMAC_ST2RPQ[1]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[1]_qnb QNB Queue Number (0-2)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2rpq[2] GMACST2RPQ[2] Screening Type 2 Register Priority Queue (index = 0) 0
@{*/

/** GMAC_GMAC_ST2RPQ[2]_COMPCE Compare C Enable **/
#define GMAC_GMAC_ST2RPQ[2]_COMPCE		(1 << 30)

#define GMAC_GMAC_ST2RPQ[2]_COMPC_SHIFT		25
#define GMAC_GMAC_ST2RPQ[2]_COMPC_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[2]_compc COMPC Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[2]_COMPBE Compare B Enable **/
#define GMAC_GMAC_ST2RPQ[2]_COMPBE		(1 << 24)

#define GMAC_GMAC_ST2RPQ[2]_COMPB_SHIFT		19
#define GMAC_GMAC_ST2RPQ[2]_COMPB_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[2]_compb COMPB Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[2]_COMPAE Compare A Enable **/
#define GMAC_GMAC_ST2RPQ[2]_COMPAE		(1 << 18)

#define GMAC_GMAC_ST2RPQ[2]_COMPA_SHIFT		13
#define GMAC_GMAC_ST2RPQ[2]_COMPA_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[2]_compa COMPA Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

