grevaillot/svd_tools/headers/ATSAMV71J19/gmac.h
/** GMAC_GMAC_ST2RPQ[2]_ETHE EtherType Enable **/
#define GMAC_GMAC_ST2RPQ[2]_ETHE		(1 << 12)

#define GMAC_GMAC_ST2RPQ[2]_I2ETH_SHIFT		9
#define GMAC_GMAC_ST2RPQ[2]_I2ETH_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[2]_i2eth I2ETH Index of Screening Type 2 EtherType register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[2]_VLANE VLAN Enable **/
#define GMAC_GMAC_ST2RPQ[2]_VLANE		(1 << 8)

#define GMAC_GMAC_ST2RPQ[2]_VLANP_SHIFT		4
#define GMAC_GMAC_ST2RPQ[2]_VLANP_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[2]_vlanp VLANP VLAN Priority
@{*/
/**@}*/


#define GMAC_GMAC_ST2RPQ[2]_QNB_SHIFT		0
#define GMAC_GMAC_ST2RPQ[2]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[2]_qnb QNB Queue Number (0-2)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2rpq[3] GMACST2RPQ[3] Screening Type 2 Register Priority Queue (index = 0) 0
@{*/

/** GMAC_GMAC_ST2RPQ[3]_COMPCE Compare C Enable **/
#define GMAC_GMAC_ST2RPQ[3]_COMPCE		(1 << 30)

#define GMAC_GMAC_ST2RPQ[3]_COMPC_SHIFT		25
#define GMAC_GMAC_ST2RPQ[3]_COMPC_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[3]_compc COMPC Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[3]_COMPBE Compare B Enable **/
#define GMAC_GMAC_ST2RPQ[3]_COMPBE		(1 << 24)

#define GMAC_GMAC_ST2RPQ[3]_COMPB_SHIFT		19
#define GMAC_GMAC_ST2RPQ[3]_COMPB_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[3]_compb COMPB Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[3]_COMPAE Compare A Enable **/
#define GMAC_GMAC_ST2RPQ[3]_COMPAE		(1 << 18)

#define GMAC_GMAC_ST2RPQ[3]_COMPA_SHIFT		13
#define GMAC_GMAC_ST2RPQ[3]_COMPA_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[3]_compa COMPA Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[3]_ETHE EtherType Enable **/
#define GMAC_GMAC_ST2RPQ[3]_ETHE		(1 << 12)

#define GMAC_GMAC_ST2RPQ[3]_I2ETH_SHIFT		9
#define GMAC_GMAC_ST2RPQ[3]_I2ETH_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[3]_i2eth I2ETH Index of Screening Type 2 EtherType register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[3]_VLANE VLAN Enable **/
#define GMAC_GMAC_ST2RPQ[3]_VLANE		(1 << 8)

#define GMAC_GMAC_ST2RPQ[3]_VLANP_SHIFT		4
#define GMAC_GMAC_ST2RPQ[3]_VLANP_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[3]_vlanp VLANP VLAN Priority
@{*/
/**@}*/


#define GMAC_GMAC_ST2RPQ[3]_QNB_SHIFT		0
#define GMAC_GMAC_ST2RPQ[3]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[3]_qnb QNB Queue Number (0-2)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2rpq[4] GMACST2RPQ[4] Screening Type 2 Register Priority Queue (index = 0) 0
@{*/

/** GMAC_GMAC_ST2RPQ[4]_COMPCE Compare C Enable **/
#define GMAC_GMAC_ST2RPQ[4]_COMPCE		(1 << 30)

#define GMAC_GMAC_ST2RPQ[4]_COMPC_SHIFT		25
#define GMAC_GMAC_ST2RPQ[4]_COMPC_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[4]_compc COMPC Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[4]_COMPBE Compare B Enable **/
#define GMAC_GMAC_ST2RPQ[4]_COMPBE		(1 << 24)

#define GMAC_GMAC_ST2RPQ[4]_COMPB_SHIFT		19
#define GMAC_GMAC_ST2RPQ[4]_COMPB_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[4]_compb COMPB Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[4]_COMPAE Compare A Enable **/
#define GMAC_GMAC_ST2RPQ[4]_COMPAE		(1 << 18)

#define GMAC_GMAC_ST2RPQ[4]_COMPA_SHIFT		13
#define GMAC_GMAC_ST2RPQ[4]_COMPA_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[4]_compa COMPA Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[4]_ETHE EtherType Enable **/
#define GMAC_GMAC_ST2RPQ[4]_ETHE		(1 << 12)

#define GMAC_GMAC_ST2RPQ[4]_I2ETH_SHIFT		9
#define GMAC_GMAC_ST2RPQ[4]_I2ETH_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[4]_i2eth I2ETH Index of Screening Type 2 EtherType register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[4]_VLANE VLAN Enable **/
#define GMAC_GMAC_ST2RPQ[4]_VLANE		(1 << 8)

#define GMAC_GMAC_ST2RPQ[4]_VLANP_SHIFT		4
#define GMAC_GMAC_ST2RPQ[4]_VLANP_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[4]_vlanp VLANP VLAN Priority
@{*/
/**@}*/


#define GMAC_GMAC_ST2RPQ[4]_QNB_SHIFT		0
#define GMAC_GMAC_ST2RPQ[4]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[4]_qnb QNB Queue Number (0-2)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2rpq[5] GMACST2RPQ[5] Screening Type 2 Register Priority Queue (index = 0) 0
@{*/

/** GMAC_GMAC_ST2RPQ[5]_COMPCE Compare C Enable **/
#define GMAC_GMAC_ST2RPQ[5]_COMPCE		(1 << 30)

#define GMAC_GMAC_ST2RPQ[5]_COMPC_SHIFT		25
#define GMAC_GMAC_ST2RPQ[5]_COMPC_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[5]_compc COMPC Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[5]_COMPBE Compare B Enable **/
#define GMAC_GMAC_ST2RPQ[5]_COMPBE		(1 << 24)

#define GMAC_GMAC_ST2RPQ[5]_COMPB_SHIFT		19
#define GMAC_GMAC_ST2RPQ[5]_COMPB_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[5]_compb COMPB Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[5]_COMPAE Compare A Enable **/
#define GMAC_GMAC_ST2RPQ[5]_COMPAE		(1 << 18)

#define GMAC_GMAC_ST2RPQ[5]_COMPA_SHIFT		13
#define GMAC_GMAC_ST2RPQ[5]_COMPA_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[5]_compa COMPA Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[5]_ETHE EtherType Enable **/
#define GMAC_GMAC_ST2RPQ[5]_ETHE		(1 << 12)

#define GMAC_GMAC_ST2RPQ[5]_I2ETH_SHIFT		9
#define GMAC_GMAC_ST2RPQ[5]_I2ETH_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[5]_i2eth I2ETH Index of Screening Type 2 EtherType register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[5]_VLANE VLAN Enable **/
#define GMAC_GMAC_ST2RPQ[5]_VLANE		(1 << 8)

#define GMAC_GMAC_ST2RPQ[5]_VLANP_SHIFT		4
#define GMAC_GMAC_ST2RPQ[5]_VLANP_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[5]_vlanp VLANP VLAN Priority
@{*/
/**@}*/


#define GMAC_GMAC_ST2RPQ[5]_QNB_SHIFT		0
#define GMAC_GMAC_ST2RPQ[5]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[5]_qnb QNB Queue Number (0-2)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2rpq[6] GMACST2RPQ[6] Screening Type 2 Register Priority Queue (index = 0) 0
@{*/

/** GMAC_GMAC_ST2RPQ[6]_COMPCE Compare C Enable **/
#define GMAC_GMAC_ST2RPQ[6]_COMPCE		(1 << 30)

#define GMAC_GMAC_ST2RPQ[6]_COMPC_SHIFT		25
#define GMAC_GMAC_ST2RPQ[6]_COMPC_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[6]_compc COMPC Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[6]_COMPBE Compare B Enable **/
#define GMAC_GMAC_ST2RPQ[6]_COMPBE		(1 << 24)

#define GMAC_GMAC_ST2RPQ[6]_COMPB_SHIFT		19
#define GMAC_GMAC_ST2RPQ[6]_COMPB_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[6]_compb COMPB Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

