grevaillot/svd_tools/headers/ATSAMV71J19/gmac.h
/** GMAC_GMAC_ST2RPQ[6]_COMPAE Compare A Enable **/
#define GMAC_GMAC_ST2RPQ[6]_COMPAE		(1 << 18)

#define GMAC_GMAC_ST2RPQ[6]_COMPA_SHIFT		13
#define GMAC_GMAC_ST2RPQ[6]_COMPA_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[6]_compa COMPA Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[6]_ETHE EtherType Enable **/
#define GMAC_GMAC_ST2RPQ[6]_ETHE		(1 << 12)

#define GMAC_GMAC_ST2RPQ[6]_I2ETH_SHIFT		9
#define GMAC_GMAC_ST2RPQ[6]_I2ETH_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[6]_i2eth I2ETH Index of Screening Type 2 EtherType register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[6]_VLANE VLAN Enable **/
#define GMAC_GMAC_ST2RPQ[6]_VLANE		(1 << 8)

#define GMAC_GMAC_ST2RPQ[6]_VLANP_SHIFT		4
#define GMAC_GMAC_ST2RPQ[6]_VLANP_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[6]_vlanp VLANP VLAN Priority
@{*/
/**@}*/


#define GMAC_GMAC_ST2RPQ[6]_QNB_SHIFT		0
#define GMAC_GMAC_ST2RPQ[6]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[6]_qnb QNB Queue Number (0-2)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2rpq[7] GMACST2RPQ[7] Screening Type 2 Register Priority Queue (index = 0) 0
@{*/

/** GMAC_GMAC_ST2RPQ[7]_COMPCE Compare C Enable **/
#define GMAC_GMAC_ST2RPQ[7]_COMPCE		(1 << 30)

#define GMAC_GMAC_ST2RPQ[7]_COMPC_SHIFT		25
#define GMAC_GMAC_ST2RPQ[7]_COMPC_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[7]_compc COMPC Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[7]_COMPBE Compare B Enable **/
#define GMAC_GMAC_ST2RPQ[7]_COMPBE		(1 << 24)

#define GMAC_GMAC_ST2RPQ[7]_COMPB_SHIFT		19
#define GMAC_GMAC_ST2RPQ[7]_COMPB_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[7]_compb COMPB Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[7]_COMPAE Compare A Enable **/
#define GMAC_GMAC_ST2RPQ[7]_COMPAE		(1 << 18)

#define GMAC_GMAC_ST2RPQ[7]_COMPA_SHIFT		13
#define GMAC_GMAC_ST2RPQ[7]_COMPA_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[7]_compa COMPA Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[7]_ETHE EtherType Enable **/
#define GMAC_GMAC_ST2RPQ[7]_ETHE		(1 << 12)

#define GMAC_GMAC_ST2RPQ[7]_I2ETH_SHIFT		9
#define GMAC_GMAC_ST2RPQ[7]_I2ETH_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[7]_i2eth I2ETH Index of Screening Type 2 EtherType register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[7]_VLANE VLAN Enable **/
#define GMAC_GMAC_ST2RPQ[7]_VLANE		(1 << 8)

#define GMAC_GMAC_ST2RPQ[7]_VLANP_SHIFT		4
#define GMAC_GMAC_ST2RPQ[7]_VLANP_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[7]_vlanp VLANP VLAN Priority
@{*/
/**@}*/


#define GMAC_GMAC_ST2RPQ[7]_QNB_SHIFT		0
#define GMAC_GMAC_ST2RPQ[7]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[7]_qnb QNB Queue Number (0-2)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ierpq[0] GMACIERPQ[0] Interrupt Enable Register Priority Queue (index = 1) 0
@{*/

/** GMAC_GMAC_IERPQ[0]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IERPQ[0]_HRESP		(1 << 11)
/** GMAC_GMAC_IERPQ[0]_ROVR Receive Overrun **/
#define GMAC_GMAC_IERPQ[0]_ROVR		(1 << 10)
/** GMAC_GMAC_IERPQ[0]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IERPQ[0]_TCOMP		(1 << 7)
/** GMAC_GMAC_IERPQ[0]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IERPQ[0]_TFC		(1 << 6)
/** GMAC_GMAC_IERPQ[0]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IERPQ[0]_RLEX		(1 << 5)
/** GMAC_GMAC_IERPQ[0]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IERPQ[0]_RXUBR		(1 << 2)
/** GMAC_GMAC_IERPQ[0]_RCOMP Receive Complete **/
#define GMAC_GMAC_IERPQ[0]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_ierpq[1] GMACIERPQ[1] Interrupt Enable Register Priority Queue (index = 1) 0
@{*/

/** GMAC_GMAC_IERPQ[1]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IERPQ[1]_HRESP		(1 << 11)
/** GMAC_GMAC_IERPQ[1]_ROVR Receive Overrun **/
#define GMAC_GMAC_IERPQ[1]_ROVR		(1 << 10)
/** GMAC_GMAC_IERPQ[1]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IERPQ[1]_TCOMP		(1 << 7)
/** GMAC_GMAC_IERPQ[1]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IERPQ[1]_TFC		(1 << 6)
/** GMAC_GMAC_IERPQ[1]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IERPQ[1]_RLEX		(1 << 5)
/** GMAC_GMAC_IERPQ[1]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IERPQ[1]_RXUBR		(1 << 2)
/** GMAC_GMAC_IERPQ[1]_RCOMP Receive Complete **/
#define GMAC_GMAC_IERPQ[1]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_idrpq[0] GMACIDRPQ[0] Interrupt Disable Register Priority Queue (index = 1) 0
@{*/

/** GMAC_GMAC_IDRPQ[0]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IDRPQ[0]_HRESP		(1 << 11)
/** GMAC_GMAC_IDRPQ[0]_ROVR Receive Overrun **/
#define GMAC_GMAC_IDRPQ[0]_ROVR		(1 << 10)
/** GMAC_GMAC_IDRPQ[0]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IDRPQ[0]_TCOMP		(1 << 7)
/** GMAC_GMAC_IDRPQ[0]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IDRPQ[0]_TFC		(1 << 6)
/** GMAC_GMAC_IDRPQ[0]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IDRPQ[0]_RLEX		(1 << 5)
/** GMAC_GMAC_IDRPQ[0]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IDRPQ[0]_RXUBR		(1 << 2)
/** GMAC_GMAC_IDRPQ[0]_RCOMP Receive Complete **/
#define GMAC_GMAC_IDRPQ[0]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_idrpq[1] GMACIDRPQ[1] Interrupt Disable Register Priority Queue (index = 1) 0
@{*/

/** GMAC_GMAC_IDRPQ[1]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IDRPQ[1]_HRESP		(1 << 11)
/** GMAC_GMAC_IDRPQ[1]_ROVR Receive Overrun **/
#define GMAC_GMAC_IDRPQ[1]_ROVR		(1 << 10)
/** GMAC_GMAC_IDRPQ[1]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IDRPQ[1]_TCOMP		(1 << 7)
/** GMAC_GMAC_IDRPQ[1]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IDRPQ[1]_TFC		(1 << 6)
/** GMAC_GMAC_IDRPQ[1]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IDRPQ[1]_RLEX		(1 << 5)
/** GMAC_GMAC_IDRPQ[1]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IDRPQ[1]_RXUBR		(1 << 2)
/** GMAC_GMAC_IDRPQ[1]_RCOMP Receive Complete **/
#define GMAC_GMAC_IDRPQ[1]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_imrpq[0] GMACIMRPQ[0] Interrupt Mask Register Priority Queue (index = 1) 0
@{*/

/** GMAC_GMAC_IMRPQ[0]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IMRPQ[0]_HRESP		(1 << 11)
/** GMAC_GMAC_IMRPQ[0]_ROVR Receive Overrun **/
#define GMAC_GMAC_IMRPQ[0]_ROVR		(1 << 10)
/** GMAC_GMAC_IMRPQ[0]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IMRPQ[0]_TCOMP		(1 << 7)
/** GMAC_GMAC_IMRPQ[0]_AHB AHB Error **/
#define GMAC_GMAC_IMRPQ[0]_AHB		(1 << 6)
/** GMAC_GMAC_IMRPQ[0]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IMRPQ[0]_RLEX		(1 << 5)
/** GMAC_GMAC_IMRPQ[0]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IMRPQ[0]_RXUBR		(1 << 2)
/** GMAC_GMAC_IMRPQ[0]_RCOMP Receive Complete **/
#define GMAC_GMAC_IMRPQ[0]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_imrpq[1] GMACIMRPQ[1] Interrupt Mask Register Priority Queue (index = 1) 0
@{*/

/** GMAC_GMAC_IMRPQ[1]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IMRPQ[1]_HRESP		(1 << 11)
/** GMAC_GMAC_IMRPQ[1]_ROVR Receive Overrun **/
#define GMAC_GMAC_IMRPQ[1]_ROVR		(1 << 10)
/** GMAC_GMAC_IMRPQ[1]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IMRPQ[1]_TCOMP		(1 << 7)
/** GMAC_GMAC_IMRPQ[1]_AHB AHB Error **/
#define GMAC_GMAC_IMRPQ[1]_AHB		(1 << 6)
/** GMAC_GMAC_IMRPQ[1]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IMRPQ[1]_RLEX		(1 << 5)
/** GMAC_GMAC_IMRPQ[1]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IMRPQ[1]_RXUBR		(1 << 2)
/** GMAC_GMAC_IMRPQ[1]_RCOMP Receive Complete **/
#define GMAC_GMAC_IMRPQ[1]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_st2er[0] GMACST2ER[0] Screening Type 2 Ethertype Register (index = 0) 0
@{*/


#define GMAC_GMAC_ST2ER[0]_COMPVAL_SHIFT		0
#define GMAC_GMAC_ST2ER[0]_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2er[0]_compval COMPVAL Ethertype Compare Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2er[1] GMACST2ER[1] Screening Type 2 Ethertype Register (index = 0) 0
@{*/


#define GMAC_GMAC_ST2ER[1]_COMPVAL_SHIFT		0
#define GMAC_GMAC_ST2ER[1]_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2er[1]_compval COMPVAL Ethertype Compare Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2er[2] GMACST2ER[2] Screening Type 2 Ethertype Register (index = 0) 0
@{*/


