grevaillot/svd_tools/headers/ATSAMV71J19/gmac.h
#define GMAC_GMAC_ST2ER[2]_COMPVAL_SHIFT		0
#define GMAC_GMAC_ST2ER[2]_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2er[2]_compval COMPVAL Ethertype Compare Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2er[3] GMACST2ER[3] Screening Type 2 Ethertype Register (index = 0) 0
@{*/


#define GMAC_GMAC_ST2ER[3]_COMPVAL_SHIFT		0
#define GMAC_GMAC_ST2ER[3]_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2er[3]_compval COMPVAL Ethertype Compare Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw00 GMACST2CW00 Screening Type 2 Compare Word 0 Register (index = 0)
@{*/


#define GMAC_GMAC_ST2CW00_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW00_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw00_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW00_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW00_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw00_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw10 GMACST2CW10 Screening Type 2 Compare Word 1 Register (index = 0)
@{*/


#define GMAC_GMAC_ST2CW10_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW10_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw10_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW10_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW10_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw10_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw01 GMACST2CW01 Screening Type 2 Compare Word 0 Register (index = 1)
@{*/


#define GMAC_GMAC_ST2CW01_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW01_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw01_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW01_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW01_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw01_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw11 GMACST2CW11 Screening Type 2 Compare Word 1 Register (index = 1)
@{*/


#define GMAC_GMAC_ST2CW11_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW11_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw11_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW11_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW11_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw11_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw02 GMACST2CW02 Screening Type 2 Compare Word 0 Register (index = 2)
@{*/


#define GMAC_GMAC_ST2CW02_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW02_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw02_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW02_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW02_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw02_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw12 GMACST2CW12 Screening Type 2 Compare Word 1 Register (index = 2)
@{*/


#define GMAC_GMAC_ST2CW12_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW12_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw12_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW12_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW12_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw12_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw03 GMACST2CW03 Screening Type 2 Compare Word 0 Register (index = 3)
@{*/


#define GMAC_GMAC_ST2CW03_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW03_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw03_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW03_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW03_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw03_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw13 GMACST2CW13 Screening Type 2 Compare Word 1 Register (index = 3)
@{*/


#define GMAC_GMAC_ST2CW13_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW13_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw13_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW13_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW13_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw13_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw04 GMACST2CW04 Screening Type 2 Compare Word 0 Register (index = 4)
@{*/


#define GMAC_GMAC_ST2CW04_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW04_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw04_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW04_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW04_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw04_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw14 GMACST2CW14 Screening Type 2 Compare Word 1 Register (index = 4)
@{*/


#define GMAC_GMAC_ST2CW14_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW14_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw14_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW14_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW14_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw14_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw05 GMACST2CW05 Screening Type 2 Compare Word 0 Register (index = 5)
@{*/


#define GMAC_GMAC_ST2CW05_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW05_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw05_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW05_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW05_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw05_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw15 GMACST2CW15 Screening Type 2 Compare Word 1 Register (index = 5)
@{*/


#define GMAC_GMAC_ST2CW15_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW15_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw15_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW15_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW15_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw15_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw06 GMACST2CW06 Screening Type 2 Compare Word 0 Register (index = 6)
@{*/


#define GMAC_GMAC_ST2CW06_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW06_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw06_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW06_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW06_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw06_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw16 GMACST2CW16 Screening Type 2 Compare Word 1 Register (index = 6)
@{*/


#define GMAC_GMAC_ST2CW16_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW16_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw16_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW16_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW16_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw16_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw07 GMACST2CW07 Screening Type 2 Compare Word 0 Register (index = 7)
@{*/


#define GMAC_GMAC_ST2CW07_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW07_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw07_compval COMPVAL Compare Value
@{*/
/**@}*/


