grevaillot/svd_tools/headers/ATSAMV71J19/gmac.h
#define GMAC_GMAC_ST2CW07_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW07_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw07_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw17 GMACST2CW17 Screening Type 2 Compare Word 1 Register (index = 7)
@{*/


#define GMAC_GMAC_ST2CW17_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW17_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw17_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW17_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW17_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw17_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw08 GMACST2CW08 Screening Type 2 Compare Word 0 Register (index = 8)
@{*/


#define GMAC_GMAC_ST2CW08_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW08_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw08_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW08_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW08_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw08_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw18 GMACST2CW18 Screening Type 2 Compare Word 1 Register (index = 8)
@{*/


#define GMAC_GMAC_ST2CW18_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW18_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw18_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW18_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW18_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw18_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw09 GMACST2CW09 Screening Type 2 Compare Word 0 Register (index = 9)
@{*/


#define GMAC_GMAC_ST2CW09_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW09_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw09_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW09_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW09_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw09_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw19 GMACST2CW19 Screening Type 2 Compare Word 1 Register (index = 9)
@{*/


#define GMAC_GMAC_ST2CW19_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW19_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw19_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW19_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW19_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw19_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw010 GMACST2CW010 Screening Type 2 Compare Word 0 Register (index = 10)
@{*/


#define GMAC_GMAC_ST2CW010_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW010_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw010_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW010_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW010_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw010_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw110 GMACST2CW110 Screening Type 2 Compare Word 1 Register (index = 10)
@{*/


#define GMAC_GMAC_ST2CW110_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW110_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw110_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW110_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW110_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw110_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw011 GMACST2CW011 Screening Type 2 Compare Word 0 Register (index = 11)
@{*/


#define GMAC_GMAC_ST2CW011_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW011_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw011_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW011_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW011_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw011_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw111 GMACST2CW111 Screening Type 2 Compare Word 1 Register (index = 11)
@{*/


#define GMAC_GMAC_ST2CW111_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW111_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw111_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW111_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW111_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw111_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw012 GMACST2CW012 Screening Type 2 Compare Word 0 Register (index = 12)
@{*/


#define GMAC_GMAC_ST2CW012_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW012_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw012_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW012_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW012_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw012_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw112 GMACST2CW112 Screening Type 2 Compare Word 1 Register (index = 12)
@{*/


#define GMAC_GMAC_ST2CW112_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW112_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw112_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW112_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW112_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw112_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw013 GMACST2CW013 Screening Type 2 Compare Word 0 Register (index = 13)
@{*/


#define GMAC_GMAC_ST2CW013_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW013_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw013_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW013_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW013_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw013_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw113 GMACST2CW113 Screening Type 2 Compare Word 1 Register (index = 13)
@{*/


#define GMAC_GMAC_ST2CW113_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW113_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw113_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW113_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW113_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw113_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw014 GMACST2CW014 Screening Type 2 Compare Word 0 Register (index = 14)
@{*/


#define GMAC_GMAC_ST2CW014_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW014_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw014_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW014_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW014_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw014_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw114 GMACST2CW114 Screening Type 2 Compare Word 1 Register (index = 14)
@{*/


