grevaillot/svd_tools/headers/ATSAMV71J19/gmac.h
#define GMAC_GMAC_ST2CW114_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW114_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw114_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW114_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW114_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw114_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw015 GMACST2CW015 Screening Type 2 Compare Word 0 Register (index = 15)
@{*/


#define GMAC_GMAC_ST2CW015_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW015_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw015_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW015_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW015_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw015_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw115 GMACST2CW115 Screening Type 2 Compare Word 1 Register (index = 15)
@{*/


#define GMAC_GMAC_ST2CW115_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW115_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw115_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW115_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW115_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw115_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw016 GMACST2CW016 Screening Type 2 Compare Word 0 Register (index = 16)
@{*/


#define GMAC_GMAC_ST2CW016_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW016_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw016_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW016_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW016_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw016_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw116 GMACST2CW116 Screening Type 2 Compare Word 1 Register (index = 16)
@{*/


#define GMAC_GMAC_ST2CW116_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW116_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw116_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW116_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW116_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw116_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw017 GMACST2CW017 Screening Type 2 Compare Word 0 Register (index = 17)
@{*/


#define GMAC_GMAC_ST2CW017_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW017_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw017_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW017_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW017_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw017_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw117 GMACST2CW117 Screening Type 2 Compare Word 1 Register (index = 17)
@{*/


#define GMAC_GMAC_ST2CW117_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW117_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw117_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW117_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW117_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw117_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw018 GMACST2CW018 Screening Type 2 Compare Word 0 Register (index = 18)
@{*/


#define GMAC_GMAC_ST2CW018_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW018_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw018_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW018_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW018_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw018_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw118 GMACST2CW118 Screening Type 2 Compare Word 1 Register (index = 18)
@{*/


#define GMAC_GMAC_ST2CW118_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW118_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw118_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW118_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW118_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw118_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw019 GMACST2CW019 Screening Type 2 Compare Word 0 Register (index = 19)
@{*/


#define GMAC_GMAC_ST2CW019_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW019_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw019_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW019_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW019_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw019_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw119 GMACST2CW119 Screening Type 2 Compare Word 1 Register (index = 19)
@{*/


#define GMAC_GMAC_ST2CW119_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW119_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw119_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW119_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW119_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw119_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw020 GMACST2CW020 Screening Type 2 Compare Word 0 Register (index = 20)
@{*/


#define GMAC_GMAC_ST2CW020_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW020_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw020_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW020_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW020_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw020_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw120 GMACST2CW120 Screening Type 2 Compare Word 1 Register (index = 20)
@{*/


#define GMAC_GMAC_ST2CW120_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW120_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw120_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW120_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW120_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw120_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw021 GMACST2CW021 Screening Type 2 Compare Word 0 Register (index = 21)
@{*/


#define GMAC_GMAC_ST2CW021_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW021_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw021_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW021_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW021_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw021_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw121 GMACST2CW121 Screening Type 2 Compare Word 1 Register (index = 21)
@{*/


