grevaillot/svd_tools/headers/ATSAMV71J19/gmac.h
#define GMAC_GMAC_ST2CW121_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW121_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw121_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW121_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW121_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw121_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw022 GMACST2CW022 Screening Type 2 Compare Word 0 Register (index = 22)
@{*/


#define GMAC_GMAC_ST2CW022_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW022_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw022_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW022_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW022_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw022_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw122 GMACST2CW122 Screening Type 2 Compare Word 1 Register (index = 22)
@{*/


#define GMAC_GMAC_ST2CW122_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW122_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw122_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW122_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW122_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw122_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw023 GMACST2CW023 Screening Type 2 Compare Word 0 Register (index = 23)
@{*/


#define GMAC_GMAC_ST2CW023_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW023_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw023_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW023_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW023_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw023_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw123 GMACST2CW123 Screening Type 2 Compare Word 1 Register (index = 23)
@{*/


#define GMAC_GMAC_ST2CW123_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW123_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw123_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW123_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW123_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw123_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/
